---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.DontEditNestedGroup
source: html/88c1d83c-5dd0-d010-0c85-5bcb827eeb75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.DontEditNestedGroup Property

Cannot edit nested Groups while inside Edit Group mode for its host Group. To edit the nested Group finish editing all Groups.
 Use the Tab key to select the nested Group and edit it directly.

## Syntax (C#)
```csharp
public static FailureDefinitionId DontEditNestedGroup { get; }
```